Revit 2024 API
BuiltInFailures.CurtainWallFailures.GridOutOfOrderError Property
 Curtain wall grid lines have changed order.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId GridOutOfOrderError { get; }
Visual Basic
Public Shared ReadOnly Property GridOutOfOrderError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ GridOutOfOrderError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace